chore(docs): update arch diagram
